xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 查询/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_dma.h
}

/**
  * @brief    
  * @rmtoll   CHCR    PRI    LL_DMA_GetChannelPriority
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_PRIORITY_LOW
  *           @arg @ref LL_DMA_CHANNEL_PRIORITY_MEDIUM
  *           @arg @ref LL_DMA_CHANNEL_PRIORITY_HIGH
  *           @arg @ref LL_DMA_CHANNEL_PRIORITY_VERYHIGH
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelPriority(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_PRI_Msk));
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CHCR_PRI_Msk));
    }
}

/**
  * @brief    
  * @rmtoll   CHCR    INC    LL_DMA_SetChannelAddrIncremental
  * @param    DMAx DMA instance
  * @param    Incremental This parameter can be one of the following values:
  *           @arg @ref LL_DMA_INCREMENTAL_INCREASE
  *           @arg @ref LL_DMA_INCREMENTAL_REDUCE
  *           @arg @ref LL_DMA_CH7_RAM_ADDR_INCREASE 
  *           @arg @ref LL_DMA_CH7_RAM_ADDR_REDUCE
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_SetChannelAddrIncremental(DMA_Type* DMAx, uint32_t Incremental, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[Channel].CHCR, DMA_CHCR_INC_Msk, Incremental);
    }
    else
    {
        MODIFY_REG(Temp->CH7CR, DMA_CH7CR_RAM_INC_Msk, Incremental);
    }
}

/**
  * @brief    
  * @rmtoll   CHCR    INC    LL_DMA_GetChannelAddrIncremental
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_DMA_INCREMENTAL_INCREASE
  *           @arg @ref LL_DMA_INCREMENTAL_REDUCE
  *           @arg @ref LL_DMA_CH7_RAM_ADDR_INCREASE 
  *           @arg @ref LL_DMA_CH7_RAM_ADDR_REDUCE
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelAddrIncremental(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_INC_Msk));
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CH7CR_RAM_INC_Msk));
    }
}
/**
  * @brief    
  * @rmtoll   CH7CR    INC    LL_DMA_SetFlash_AddrIncremental
  * @param    DMAx DMA instance
  * @param    Incremental This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CH7_FLASH_ADDR_INCREASE 
  *           @arg @ref LL_DMA_CH7_FLASH_ADDR_REDUCE   
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_SetFlash_AddrIncremental(DMA_Type* DMAx, uint32_t Incremental)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    MODIFY_REG(Temp->CH7CR, DMA_CH7CR_FLASH_INC_Msk, Incremental);
}

/**
  * @brief    
  * @rmtoll   CHCR    INC    LL_DMA_GetFlashAddrIncremental
  * @param    DMAx DMA instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_DMA_CH7_FLASH_ADDR_INCREASE 
  *           @arg @ref LL_DMA_CH7_FLASH_ADDR_REDUCE   
  */
__STATIC_INLINE uint32_t LL_DMA_GetFlashAddrIncremental(DMA_Type* DMAx)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CH7CR_FLASH_INC_Msk));
}
/**
  * @brief    
  * @rmtoll   CHCR    SSEL    LL_DMA_SetChannelPeripheralMap
  * @param    DMAx DMA instance
  * @param    PeripheralMap This parameter can be one of the following values:
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION1
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION2
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION3
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION4
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION5
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION6
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION7
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION8
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_SetChannelPeripheralMap(DMA_Type* DMAx, uint32_t PeripheralMap, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[Channel].CHCR, DMA_CHCR_SSEL_Msk, PeripheralMap);
    }
}

/**
  * @brief    
  * @rmtoll   CHCR    SSEL    LL_DMA_GetChannelPeripheralMap
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION1
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION2
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION3
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION4
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION5
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION6
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION7
  *           @arg @ref LL_DMA_PERIPHERAL_FUNCTION8
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelPeripheralMap(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_SSEL_Msk));
    }
    return 0;
}

/**
  * @brief    
  * @rmtoll   CHCR    DIR    LL_DMA_SetChannelTransDirection
  * @param    DMAx DMA instance
  * @param    TransDirection This parameter can be one of the following values:
  *           @arg @ref LL_DMA_DIR_PERIPHERAL_TO_RAM
  *           @arg @ref LL_DMA_DIR_RAM_TO_PERIPHERAL
  *           @arg @ref LL_DMA_DIR_FLASH_TO_RAM  
  *           @arg @ref LL_DMA_DIR_RAM_TO_FLASH  

  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_SetChannelTransDirection(DMA_Type* DMAx, uint32_t TransDirection, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[Channel].CHCR, DMA_CHCR_DIR_Msk, TransDirection);
    }
    else
    {
        MODIFY_REG(Temp->CH7CR, DMA_CH7CR_DIR_Msk, TransDirection);
    }  
}

/**
  * @brief    
  * @rmtoll   CHCR    DIR    LL_DMA_GetChannelTransDirection
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_DMA_DIR_PERIPHERAL_TO_RAM
  *           @arg @ref LL_DMA_DIR_RAM_TO_PERIPHERAL
  *           @arg @ref LL_DMA_DIR_FLASH_TO_RAM  
  *           @arg @ref LL_DMA_DIR_RAM_TO_FLASH
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelTransDirection(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_DIR_Msk));
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CH7CR_DIR_Msk));
    }  
}

/**
  * @brief    
  * @rmtoll   CHCR    BDW    LL_DMA_SetChannelBandWidth
  * @param    DMAx DMA instance
  * @param    BandWidth This parameter can be one of the following values:
  *           @arg @ref LL_DMA_BAND_WIDTH_BYTE
  *           @arg @ref LL_DMA_BAND_WIDTH_HALF_WORD
  *           @arg @ref LL_DMA_BAND_WIDTH_WORD
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_SetChannelBandWidth(DMA_Type* DMAx, uint32_t BandWidth, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[Channel].CHCR, DMA_CHCR_BDW_Msk, BandWidth);
    }
}

/**
  * @brief    
  * @rmtoll   CHCR    BDW    LL_DMA_GetChannelBandWidth
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_DMA_BAND_WIDTH_BYTE
  *           @arg @ref LL_DMA_BAND_WIDTH_HALF_WORD
  *           @arg @ref LL_DMA_BAND_WIDTH_WORD
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelBandWidth(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_BDW_Msk));
    }
    return 0;
}

/**
  * @brief    
  * @rmtoll   CHCR    CIRC    LL_DMA_Enable_CircularMode
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_Enable_CircularMode(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        SET_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_CIRC_Msk);
    }
    else
    {
        SET_BIT(Temp->CH7CR, DMA_CHCR_CIRC_Msk);
    }   
}

/**
  * @brief    
  * @rmtoll   CHCR    CIRC    LL_DMA_IsEnabled_CircularMode
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabled_CircularMode(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_CIRC_Msk) == DMA_CHCR_CIRC_Msk);
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CHCR_CIRC_Msk) == DMA_CHCR_CIRC_Msk);
    }  
}

/**
  * @brief    
  * @rmtoll   CHCR    CIRC    LL_DMA_Disable_CircularMode
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_Disable_CircularMode(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        CLEAR_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_CIRC_Msk);
    }
    else
    {
        CLEAR_BIT(Temp->CH7CR, DMA_CHCR_CIRC_Msk);
    }  
}

/**
  * @brief    
  * @rmtoll   CHCR    FTIE    LL_DMA_EnableIT_FinishedTransfer
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_EnableIT_FinishedTransfer(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        SET_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_FTIE_Msk);
    }
    else
    {
        SET_BIT(Temp->CH7CR, DMA_CHCR_FTIE_Msk);
    }   
}

/**
  * @brief    
  * @rmtoll   CHCR    FTIE    LL_DMA_IsEnabledIT_FinishedTransfer
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_FinishedTransfer(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_FTIE_Msk) == DMA_CHCR_CIRC_Msk);
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CHCR_CIRC_Msk) == DMA_CHCR_FTIE_Msk);
    }   
}

/**
  * @brief    
  * @rmtoll   CHCR    FTIE    LL_DMA_DisableIT_FinishedTransfer
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_DisableIT_FinishedTransfer(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        CLEAR_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_FTIE_Msk);
    }
    else
    {
        CLEAR_BIT(Temp->CH7CR, DMA_CHCR_FTIE_Msk);
    }   
}

/**
  * @brief    
  * @rmtoll   CHCR    HTIE    LL_DMA_EnableIT_HalfTransfer
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_EnableIT_HalfTransfer(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        SET_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_HTIE_Msk);
    }
    else
    {
        SET_BIT(Temp->CH7CR, DMA_CHCR_HTIE_Msk);
    }    
}

/**
  * @brief    
  * @rmtoll   CHCR    HTIE    LL_DMA_IsEnabledIT_HalfTransfer
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabledIT_HalfTransfer(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_HTIE_Msk) == DMA_CHCR_CIRC_Msk);
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CHCR_CIRC_Msk) == DMA_CHCR_HTIE_Msk);
    }   
}

/**
  * @brief    
  * @rmtoll   CHCR    HTIE    LL_DMA_DisableIT_HalfTransfer
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_DisableIT_HalfTransfer(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        CLEAR_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_HTIE_Msk);
    }
    else
    {
        CLEAR_BIT(Temp->CH7CR, DMA_CHCR_HTIE_Msk);
    }     
}

/**
  * @brief    
  * @rmtoll   CHCR    EN    LL_DMA_Enable_Channel
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_Enable_Channel(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        SET_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_EN_Msk);
    }
    else
    {
        SET_BIT(Temp->CH7CR, DMA_CHCR_EN_Msk);
    }   
}

/**
  * @brief    
  * @rmtoll   CHCR    EN    LL_DMA_IsEnabled_Channel
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsEnabled_Channel(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_EN_Msk) == DMA_CHCR_CIRC_Msk);
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CHCR_CIRC_Msk) == DMA_CHCR_EN_Msk);
    }  
}

/**
  * @brief    
  * @rmtoll   CHCR    EN    LL_DMA_Disable_Channel
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_Disable_Channel(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        CLEAR_BIT(Temp->Channel[Channel].CHCR, DMA_CHCR_EN_Msk);
    }
    else
    {
        CLEAR_BIT(Temp->CH7CR, DMA_CHCR_EN_Msk);
    }    
}

/**
  * @brief    
  * @rmtoll   MEMAD        LL_DMA_SetChannelMemAddr
  * @param    DMAx DMA instance
  * @param    Data 
  * @param    Channel 
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_SetChannelMemAddr(DMA_Type* DMAx, uint32_t Data, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[Channel].CHMAD, (0xffffffffU ), (Data));
    }
    else
    {
        MODIFY_REG(Temp->CH7MAD, (0xffffffffU ), (Data));
    } 
}

/**
  * @brief    
  * @rmtoll   MEMAD        LL_DMA_GetChannelMemAddr
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelMemAddr(DMA_Type* DMAx, uint32_t Channel)
{
    DMA_ADDR*  Temp = (DMA_ADDR*)DMAx;
    
    if(Channel <= LL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[Channel].CHMAD, (0xffffffffU )));
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7MAD,(0xffffffffU )));
    } 

    
