xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 查询/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_dma.h
}

/**
  * @brief    
  * @rmtoll   CH7FLSAD        LL_DMA_SetChannelFlashAddr
  * @param    DMAx DMA instance
  * @param    Data 
  * @param    Channel 
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_SetChannelFlashAddr(DMA_Type* DMAx, uint32_t Data, uint32_t Channel)
{
    MODIFY_REG(DMAx->CH7FLSAD, (0xffffffffU ), (Data)); 
}

/**
  * @brief    
  * @rmtoll   CH7FLSAD        LL_DMA_GetChannelFlashAddr
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   
  */
__STATIC_INLINE uint32_t LL_DMA_GetChannelFlashAddr(DMA_Type* DMAx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(DMAx->CH7FLSAD, (0xffffffffU ))); 
}

/**
  * @brief    
  * @rmtoll   ISR    ADDRERR    LL_DMA_IsActiveFlag_ADDRERR
  * @param    DMAx DMA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_ADDRERR(DMA_Type* DMAx)
{
    return (uint32_t)(READ_BIT(DMAx->ISR, DMA_ISR_ADDRERR_Msk) == (DMA_ISR_ADDRERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    ADDRERR    LL_DMA_ClearFlag_ADDRERR
  * @param    DMAx DMA instance
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_ADDRERR(DMA_Type* DMAx)
{
    WRITE_REG(DMAx->ISR, DMA_ISR_ADDRERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    CHFT    LL_DMA_IsActiveFlag_Finished
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_Finished(DMA_Type* DMAx, uint32_t Channel)
{
   return (uint32_t)(uint32_t)(READ_BIT(DMAx->ISR, (DMA_ISR_CHFT_Msk<<Channel)) == (DMA_ISR_CHFT_Msk<<Channel));
}

/**
  * @brief    
  * @rmtoll   ISR    CHFT    LL_DMA_ClearFlag_Finished
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_Finished(DMA_Type* DMAx, uint32_t Channel)
{
    WRITE_REG(DMAx->ISR, (DMA_ISR_CHFT_Msk<<Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    CHHT    LL_DMA_IsActiveFlag_Half
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DMA_IsActiveFlag_Half(DMA_Type* DMAx, uint32_t Channel)
{
    return (uint32_t)(uint32_t)(READ_BIT(DMAx->ISR, (DMA_ISR_CHHT_Msk<<Channel)) == (DMA_ISR_CHHT_Msk<<Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    CHHT    LL_DMA_ClearFlag_Half
  * @param    DMAx DMA instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_DMA_CHANNEL_0
  *           @arg @ref LL_DMA_CHANNEL_1
  *           @arg @ref LL_DMA_CHANNEL_2
  *           @arg @ref LL_DMA_CHANNEL_3
  *           @arg @ref LL_DMA_CHANNEL_4
  *           @arg @ref LL_DMA_CHANNEL_5
  *           @arg @ref LL_DMA_CHANNEL_6
  *           @arg @ref LL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void LL_DMA_ClearFlag_Half(DMA_Type* DMAx, uint32_t Channel)
{
    WRITE_REG(DMAx->ISR, (DMA_ISR_CHHT_Msk<<Channel)); 
}

/**
  * @}
  */

/** @defgroup DMA_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus LL_DMA_DeInit(DMA_Type *DMAx);
ErrorStatus LL_DMA_Init(DMA_Type *DMAx,LL_DMA_InitTypeDef *DMA_InitStruct,uint32_t Channel);
ErrorStatus LL_StartOnceDMATransmion(DMA_Type *DMAx,LL_DMA_InitTypeDef *DMA_InitStruct ,uint32_t Channel);
void LL_DMA_StructInit(LL_DMA_InitTypeDef *InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_DMA_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-25**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
